OdDAI.ExplicitAttribute.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns An OdRxValue object that contains the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.ExplicitAttribute.redeclaring
\details
Retrieves definition of redeclared explicit attribute.
\returns Returns a smart pointer to the container with definition of redeclared explicit attribute.

OdDAI.ExplicitAttribute.optional
\details
Determines whether the attribute is optional.
\returns true if the attribute is optional; otherwise, the method returns false.

OdDAI.ExplicitAttribute.domain
\details
Retrieves the data type referenced by the attribute.
\returns A smart pointer to the data type.

OdDAI.ExplicitAttribute.#ctor
\details
Creates a new attribute object with default parameters.
The value of the created attribute is mandatory by default.

OdDAI.ExplicitAttribute
\details
A class that implements the functionality for storing and manipulating of attributes.